tests/load/ws-burst.yml
config:
  target: "http://127.0.0.1:8000"
  phases:
    - duration: 10
      arrivalRate: 3
  engines:
    ws: {}

scenarios:
  - name: Authenticated WS connect and subscribe
    flow:
      - get:
          url: "/ready"
          expect:
            - statusCode: 200
      - post:
          url: "/auth/login"
          json:
            username: "testuser"
            password: "testpass"
          expect:
            - statusCode: 200
          capture:
            json: "$.access_token"
            as: token
      - ws:
          connect: "ws://127.0.0.1:8000/ws/timeline?token={{ token }}"
      - think: 1
      - ws:
          send: '{"type":"subscribe","channel":"timeline"}'
      - think: 1
      - ws:
          send: '{"type":"unsubscribe","channel":"timeline"}'
      - ws:
          close: true